src/config/Reports/АнализЗаказаПокупателяЯШТ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Report>
		<Properties>
			<Name>АнализЗаказаПокупателяЯШТ</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

src/config/AccumulationRegisters/ЗаказыПокупателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<AccumulationRegister>
		<Properties>
			<Name>ЗаказыПокупателей</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВзаиморасчетов</Name>
					<Comment>Сумма в валюте взаиморасчетов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма в валюте упр. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусПартии</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПартийТоваров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПроцентСкидкиНаценки</Name>
					<Comment>(Общ) Процент скидки (если данная скидка детализируется по позициям номенклатуры, то является значением по умолчанию)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПроцентАвтоматическихСкидок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УсловиеАвтоматическойСкидки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УсловияСкидкиНаценки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗначениеУсловияАвтоматическойСкидки</Name>
					<Comment>(Общ) Значение условия скидки</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОплатЧекаККМ</v8:Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеКарты</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/config/AccumulationRegisters/Продажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>Продажи</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьБезСкидок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателяСезонный</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПокупателю</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПродажи</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитентуОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ЧекККМ</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДисконтнаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеКарты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/config/AccumulationRegisters/ТоварыНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыНаСкладах</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Качество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/config/Reports/АнализЗаказаПокупателяЯШТ/Ext/ObjectModule.bsl
Процедура СформироватьОтчет (ДокументРезультат,ОтборПоНаличию=Ложь) Экспорт
	
	Макет=ПолучитьМакет("МакетЗаказаПокупателя") ;
	
	ОбластьШапка=Макет.ПолучитьОбласть("Шапка");
	
	ОбластьШапка.Параметры.ЗаказПокупателя= "Отчет по :" +Строка(Заказ);
	ДокументРезультат.Вывести (ОбластьШапка);
	
	Запрос=Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент",Заказ);
	Запрос.УстановитьПараметр("ОтборПоНаличию",ОтборПоНаличию);
	
	////+++ 15.12.2014 - в зависимости от документа, а не
	// В зависимости от подразделения пользователя происходит подбор по складам
	//Если НЕ ПолучитьЗначениеПоУмолчанию(глТекущийПользователь, "УчетТолькоПоПодразделениюПользователя") Тогда
	Если не Заказ.Транзит тогда
		Запрос.Текст=" ВЫБРАТЬ     ЕстьNULL(ЗаказПокупателяТовары.НомерСтроки,1000) НомерСтроки,
		|	ЗаказыПокупателейОстаткиИОбороты.Номенклатура КАК Номенклатура,
		|	ЗаказыПокупателейОстаткиИОбороты.Номенклатура.ЕдиницаХраненияОстатков КАК ЕдиницаХраненияОстатков,
		|	ЗаказыПокупателейОстаткиИОбороты.КоличествоПриход КАК Запланировано,
		|	ЗаказыПокупателейОстаткиИОбороты.КоличествоРасход КАК ОтгруженоОтменено,
		|	ЗаказыПокупателейОстаткиИОбороты.КоличествоКонечныйОстаток КАК ОсталосьОтгрузить,
		|   ЕстьNULL(ПродажиОбороты.КоличествоОборот,0) ТолькоКоличествоПродано,
		|	РезервыКомпании.КоличествоОстаток КАК Резерв,
		|	ЕстьNULL(ОстаткиТоваров.КоличествоОстаток,0) КоличествоОстаток,
		|	ЕстьNULL(ОстаткиТоваров.КоличествоОстаток,0)-ЕстьNULL(ЗаказыПокупателейОстаткиИОбороты.КоличествоКонечныйОстаток,0) ОстатокПослеОтгрузки,
		|	ЕстьNULL(ОстаткиТоваров.КоличествоОстаток,0)-ЕстьNULL(РезервыКомпании.КоличествоОстаток,0) СвободныйОстаток,
		|	ЕстьNULL(ОстаткиТоваров.КоличествоОстаток,0)-ЕстьNULL(РезервыКомпании.КоличествоОстаток,0)-ЕстьNULL(ЗаказыПокупателейОстаткиИОбороты.КоличествоКонечныйОстаток,0) СвободныйОстатокПослеОтгрузки
		|ИЗ
		|	РегистрНакопления.ЗаказыПокупателей.ОстаткиИОбороты(,,,,ЗаказПокупателя=&ТекущийДокумент) КАК ЗаказыПокупателейОстаткиИОбороты
		|ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Продажи.Обороты(, , , ЗаказПокупателя = &ТекущийДокумент) КАК ПродажиОбороты
		|ПО ЗаказыПокупателейОстаткиИОбороты.Номенклатура =  ПродажиОбороты.Номенклатура
		|И ЗаказыПокупателейОстаткиИОбороты.ХарактеристикаНоменклатуры =  ПродажиОбороты.ХарактеристикаНоменклатуры
        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаказыПокупателей.Остатки(, ЗаказПокупателя.Проверен  И ЗаказПокупателя<>&ТекущийДокумент
		|И НЕ ЗаказПокупателя.Транзит
		|		) КАК РезервыКомпании
		|		ПО ЗаказыПокупателейОстаткиИОбороты.ХарактеристикаНоменклатуры = РезервыКомпании.ХарактеристикаНоменклатуры 
		|			И ЗаказыПокупателейОстаткиИОбороты.Номенклатура = РезервыКомпании.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(, НЕ Склад.ЗапретитьИспользование 
		|И НЕ Склад.Транзитный
		|		) КАК ОстаткиТоваров
		|		ПО ЗаказыПокупателейОстаткиИОбороты.Номенклатура = ОстаткиТоваров.Номенклатура 
		|			И ЗаказыПокупателейОстаткиИОбороты.ХарактеристикаНоменклатуры = ОстаткиТоваров.ХарактеристикаНоменклатуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ
		|		(ВЫБРАТЬ НомерСтроки,Номенклатура,ХарактеристикаНоменклатуры ИЗ	Документ.ЗаказПокупателя.Товары ГДЕ Ссылка = &ТекущийДокумент) КАК ЗаказПокупателяТовары
		|		ПО	ЗаказыПокупателейОстаткиИОбороты.Номенклатура = ЗаказПокупателяТовары.Номенклатура И
		|		ЗаказыПокупателейОстаткиИОбороты.ХарактеристикаНоменклатуры = ЗаказПокупателяТовары.ХарактеристикаНоменклатуры
		| ГДЕ НЕ &ОтборПоНаличию ИЛИ ЕстьNULL(ОстаткиТоваров.КоличествоОстаток,0)-ЕстьNULL(ЗаказыПокупателейОстаткиИОбороты.КоличествоКонечныйОстаток,0)>=0
		|УПОРЯДОЧИТЬ ПО 	ЕстьNULL(ЗаказПокупателяТовары.НомерСтроки,1000)" ;
		
		//Запрос.УстановитьПараметр("ДатаНачалаОтчета",НачалоДня(Заказ.Дата) ); // с начада дня Заказа
		
	Иначе // транзитный заказ - по транзитным складам
		Запрос.Текст=" ВЫБРАТЬ  ЕстьNULL(ЗаказПокупателяТовары.НомерСтроки,1000) НомерСтроки,
		|	ЗаказыПокупателейОстаткиИОбороты.Номенклатура КАК Номенклатура,
		|	ЗаказыПокупателейОстаткиИОбороты.Номенклатура.ЕдиницаХраненияОстатков КАК ЕдиницаХраненияОстатков,
		|	ЗаказыПокупателейОстаткиИОбороты.КоличествоПриход КАК Запланировано,
		|	ЗаказыПокупателейОстаткиИОбороты.КоличествоРасход КАК ОтгруженоОтменено,
		|	ЗаказыПокупателейОстаткиИОбороты.КоличествоКонечныйОстаток КАК ОсталосьОтгрузить,
		|	РезервыКомпании.КоличествоОстаток КАК Резерв,
		|	ЕстьNULL(ОстаткиТоваров.КоличествоОстаток,0) КоличествоОстаток,
		|	ЕстьNULL(ОстаткиТоваров.КоличествоОстаток,0)-ЕстьNULL(ЗаказыПокупателейОстаткиИОбороты.КоличествоКонечныйОстаток,0) ОстатокПослеОтгрузки,
		|	ЕстьNULL(ОстаткиТоваров.КоличествоОстаток,0)-ЕстьNULL(РезервыКомпании.КоличествоОстаток,0) СвободныйОстаток,
		|	ЕстьNULL(ОстаткиТоваров.КоличествоОстаток,0)-ЕстьNULL(РезервыКомпании.КоличествоОстаток,0)-ЕстьNULL(ЗаказыПокупателейОстаткиИОбороты.КоличествоКонечныйОстаток,0) СвободныйОстатокПослеОтгрузки
		|ИЗ
		|	РегистрНакопления.ЗаказыПокупателей.ОстаткиИОбороты(,,,,ЗаказПокупателя=&ТекущийДокумент) КАК ЗаказыПокупателейОстаткиИОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаказыПокупателей.Остатки(, ЗаказПокупателя.Проверен 
		|		И ЗаказПокупателя.Транзит И ЗаказПокупателя.Подразделение=&Подразделение И ЗаказПокупателя<>&ТекущийДокумент) КАК РезервыКомпании
		|		ПО ЗаказыПокупателейОстаткиИОбороты.ХарактеристикаНоменклатуры = РезервыКомпании.ХарактеристикаНоменклатуры 
		|			И ЗаказыПокупателейОстаткиИОбороты.Номенклатура = РезервыКомпании.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(, НЕ Склад.ЗапретитьИспользование И Склад.Транзитный И Склад.Подразделение=&Подразделение) КАК ОстаткиТоваров
		|		ПО ЗаказыПокупателейОстаткиИОбороты.Номенклатура = ОстаткиТоваров.Номенклатура 
		|			И ЗаказыПокупателейОстаткиИОбороты.ХарактеристикаНоменклатуры = ОстаткиТоваров.ХарактеристикаНоменклатуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ
		|		(ВЫБРАТЬ НомерСтроки,Номенклатура,ХарактеристикаНоменклатуры	ИЗ	Документ.ЗаказПокупателя.Товары ГДЕ Ссылка = &ТекущийДокумент) КАК ЗаказПокупателяТовары
		|		ПО	ЗаказыПокупателейОстаткиИОбороты.Номенклатура = ЗаказПокупателяТовары.Номенклатура И
		|		ЗаказыПокупателейОстаткиИОбороты.ХарактеристикаНоменклатуры = ЗаказПокупателяТовары.ХарактеристикаНоменклатуры
		| ГДЕ НЕ &ОтборПоНаличию ИЛИ ЕстьNULL(ОстаткиТоваров.КоличествоОстаток,0)-ЕстьNULL(ЗаказыПокупателейОстаткиИОбороты.КоличествоКонечныйОстаток,0)>=0
		|УПОРЯДОЧИТЬ ПО 	ЕстьNULL(ЗаказПокупателяТовары.НомерСтроки,1000)";
		
	//+++ 15.12.2014	Запрос.УстановитьПараметр("Подразделение",глТекущийПользователь.ОсновноеПодразделение);
	Запрос.УстановитьПараметр("Подразделение",Заказ.Подразделение);
	КонецЕсли;	
Выборка=Запрос.Выполнить().Выбрать();

Пока Выборка.Следующий() Цикл
	ОбластьСтрока=Макет.ПолучитьОбласть("Строка");
	ОбластьСтрока.Параметры.Заполнить(Выборка);
	ОбластьСтрока.Параметры.НомерПП=Выборка.НомерСтроки;
	Если Выборка.Номенклатура <> Null Тогда
		ОбластьСтрока.Параметры.Код=Выборка.Номенклатура.Код;
	КонецЕсли;
	ДокументРезультат.Вывести (ОбластьСтрока);
КонецЦикла;	

КонецПроцедуры
